zyunran/esp32s3-prescript-beeper/sdkconfig.defaults
# 目标芯片: ESP32-S3(必须显式声明! 默认 IDF 目标是 esp32, 拷贝/全新 clone 不自带 sdkconfig 时会被编成 esp32)
CONFIG_IDF_TARGET="esp32s3"

# 分区表: 自定义(partitions.csv, app 4MB). 详见 sdkconfig
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# 闪存 16MB(分区表 4MB app 超过默认 2MB: 全新 clone 必须显式声明, 否则生成分区表报错)
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# SNTP: 3 个服务器槽位(国内 NTP 可靠), 校时失败 10 分钟重试(默认 1 小时太久)
CONFIG_LWIP_SNTP_MAX_SERVERS=3
CONFIG_LWIP_SNTP_UPDATE_DELAY=600000

# OTA: 双分区 + 启动回滚
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_BOOTLOADER_APP_ANTI_ROLLBACK=n
